2025-fin-graduate-project/Falling-Detection-STM32/Application/STM32N6570-DK/Src/main.c
  /*** Pose pipeline Init *****************************************************/
  PosePipeline_Init(&pose_pipeline);
  pose_last_tick = HAL_GetTick();

  /*** Camera Init ************************************************************/
  CameraPipeline_Init(&lcd_bg_area.XSize, &lcd_bg_area.YSize, &pitch_nn);

  LCD_init();

  /* Start LCD Display camera pipe stream */
  CameraPipeline_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** App Loop ***************************************************************/
  while (1)
  {
    CameraPipeline_IspUpdate();

    if (pitch_nn != (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL))
    {
      /* Start NN camera single capture Snapshot */
      CameraPipeline_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
    }
    else
    {
      /* Start NN camera single capture Snapshot */
      CameraPipeline_NNPipe_Start(nn_in, CMW_MODE_SNAPSHOT);
    }

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

    uint32_t ts[2] = { 0 };

    if (pitch_nn != (STAI_NETWORK_IN_1_WIDTH * STAI_NETWORK_IN_1_CHANNEL))
    {
      SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    /*
     * Crop the image if the neural network (NN) input dimensions are not a multiple of 16.
     * The DCMIPP hardware requires the output image dimensions to be multiples of 16.
     * This ensures compatibility with the NN input dimensions.
     */
      img_crop(dcmipp_out_nn, nn_in, pitch_nn, STAI_NETWORK_IN_1_WIDTH, STAI_NETWORK_IN_1_HEIGHT, STAI_NETWORK_IN_1_CHANNEL);
      SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
    }

    ts[0] = HAL_GetTick();
    /* run ATON inference */
    Run_Inference(network_context);
    ts[1] = HAL_GetTick();

    for (int i = 0; i < number_output; i++)
    {
      SCB_InvalidateDCache_by_Addr(nn_out[i], nn_out_len[i]);
    }

    int32_t ret = app_postprocess_run((void **) nn_out, number_output, &pp_output, &pp_params);
    pose_debug_metrics.postprocess_status = ret;
    Update_PoseDebugMetrics(nn_out, nn_out_len, number_output, &pp_output);

    /* --- Pose pipeline (2프레임마다 1회 = 30fps 카메라 → 15fps 윈도우) ------- */
    static uint32_t pipeline_frame_count = 0;
    pipeline_frame_count++;

    if (pipeline_frame_count % 2 == 0)
    {
      uint32_t now_tick = HAL_GetTick();
      float32_t dt_s = (float32_t)(now_tick - pose_last_tick) * 1e-3f;
      if (dt_s <= 0.0f || dt_s > 1.0f) dt_s = 1.0f / 15.0f;
      pose_last_tick = now_tick;

      PoseFeatureVec_t feat_vec;
      PosePipeline_Process(&pose_pipeline, pp_output.pOutBuff, dt_s, &feat_vec);
      FallDetection_Update(&pose_pipeline);
    }

    Display_NetworkOutput(&pp_output, ts[1] - ts[0]);
  }
}


static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();

  NPURam_enable();

  Fuse_Programming();

  NPUCache_config();

  /*** External RAM and NOR Flash *********************************************/
  BSP_XSPI_RAM_Init(0);
  BSP_XSPI_RAM_EnableMemoryMappedMode(0);

  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

}

static void Run_Inference(stai_network *network_instance) {
  stai_return_code ret;

  do {
    ret = stai_network_run(network_instance, STAI_MODE_ASYNC);
    if (ret == STAI_RUNNING_WFE)
      LL_ATON_OSAL_WFE();
  } while (ret == STAI_RUNNING_WFE || ret == STAI_RUNNING_NO_WFE);

  ret = stai_ext_network_new_inference(network_instance);
  assert(ret == STAI_SUCCESS);
}

static void Run_TcnInference(stai_network *network_instance) {
  stai_return_code ret;

  do {
    ret = stai_tcn_network_run(network_instance, STAI_MODE_ASYNC);
    if (ret == STAI_RUNNING_WFE)
      LL_ATON_OSAL_WFE();
  } while (ret == STAI_RUNNING_WFE || ret == STAI_RUNNING_NO_WFE);

  ret = stai_ext_tcn_network_new_inference(network_instance);
  assert(ret == STAI_SUCCESS);
}

static void NeuralNetwork_init(uint32_t *nn_in_length, stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[])
{
  stai_network_info info;
  int ret;

  /* initialize runtime */
  ret = stai_runtime_init();
  assert(ret == STAI_SUCCESS);
  /* init model instance */
  ret = stai_network_init(network_context);
  assert(ret == STAI_SUCCESS);

  ret = stai_network_get_info(network_context, &info);
  assert(ret == STAI_SUCCESS);
  assert(info.n_inputs == 1);
  *number_output = STAI_NETWORK_OUT_NUM;

  /* Get the input buffer size & address */
  *nn_in_length = info.inputs[0].size_bytes;
  ret = stai_network_get_inputs(network_context, &nn_in, (stai_size *)&info.n_inputs);
  assert(ret == STAI_SUCCESS);

  /* Get the output buffers size & address */
  ret = stai_network_get_outputs(network_context, nn_out, number_output);
  assert(ret == STAI_SUCCESS);
  for (int i = 0; i < *number_output; i++)
  {
    nn_out_len[i] = info.outputs[i].size_bytes;
  }
}

static void TcnNetwork_init(void)
{
  stai_network_info info;
  stai_size number_input = STAI_TCN_NETWORK_IN_NUM;
  stai_size number_output = STAI_TCN_NETWORK_OUT_NUM;
  int ret;

  ret = stai_tcn_network_init(tcn_network_context);
  assert(ret == STAI_SUCCESS);

  ret = stai_tcn_network_get_info(tcn_network_context, &info);
  assert(ret == STAI_SUCCESS);
  assert(info.n_inputs == STAI_TCN_NETWORK_IN_NUM);
  assert(info.n_outputs == STAI_TCN_NETWORK_OUT_NUM);
  assert(info.inputs[0].size_bytes == STAI_TCN_NETWORK_IN_1_SIZE_BYTES);
  assert(info.outputs[0].size_bytes == STAI_TCN_NETWORK_OUT_1_SIZE_BYTES);

  ret = stai_tcn_network_get_inputs(tcn_network_context, &tcn_in, &number_input);
  assert(ret == STAI_SUCCESS);
  assert(number_input == STAI_TCN_NETWORK_IN_NUM);

